app/Models/AccountModel.php

    public function getAdmin($id_account = false)
    {
        if ($id_account == false) {
            return $this->findAll();
        }
        return $this
            ->select('account.*,nama_jabatan')
            ->join('jabatan as j', 'j.id_jabatan = account.id_jabatan')
            ->first();
---
SELECT *
FROM `account`
SELECT `account`.*, `nama_jabatan`
FROM `account`
JOIN `jabatan` as `j` ON `j`.`id_jabatan` = `account`.`id_jabatan`
 LIMIT 1