app/Models/AccountModel.php

SELECT `account`.*, `nama_jabatan`
FROM `account`
JOIN `jabatan` as `j` ON `j`.`id_jabatan` = `account`.`id_jabatan`
WHERE `id_account` = '18'
 LIMIT 1
---
    public function getAdmin($id_account = false)
    {
        if ($id_account == false) {
            return $this->findAll();
        }
        return $this
            ->select('account.*,nama_jabatan')
            ->where(['id_account' => $id_account])
            ->join('jabatan as j', 'j.id_jabatan = account.id_jabatan')
            ->first();